; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v1)
		(pred_5 ?v5)
		(pred_2 ?v8)
		(pred_1 ?v8)
		(pred_6 ?v5 ?v8)
		(pred_3)
		(pred_4 ?v5))

   (:action op_2
       :parameters  (?v7 ?v2)
       :precondition (and (not-eq ?v7 ?v2) 
                          (pred_2 ?v7) (pred_2 ?v2) (pred_1 ?v7))
       :effect (and  (pred_1 ?v2)
		     (not (pred_1 ?v7))))


   (:action op_1
       :parameters (?v6 ?v3)
       :precondition  (and  (pred_5 ?v6) (pred_2 ?v3)
			    (pred_6 ?v6 ?v3) (pred_1 ?v3) (pred_3))
       :effect (and (pred_4 ?v6)
		    (not (pred_6 ?v6 ?v3)) 
		    (not (pred_3))))

   (:action op_3
       :parameters  (?v6  ?v3)
       :precondition  (and  (pred_5 ?v6) (pred_2 ?v3)
			    (pred_4 ?v6) (pred_1 ?v3))
       :effect (and (pred_6 ?v6 ?v3)
		    (pred_3)
		    (not (pred_4 ?v6)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_06 obj_07 obj_01 obj_08 obj_04 
          obj_05 obj_02 obj_03 
)
(:init
(pred_2 obj_06)
(pred_2 obj_07)
(pred_2 obj_01)
(pred_2 obj_08)
(pred_2 obj_04)
(pred_5 obj_05)
(pred_5 obj_02)
(pred_5 obj_03)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(pred_3)
(pred_6 obj_05 obj_07)
(pred_6 obj_02 obj_01)
(pred_6 obj_03 obj_08)
(pred_1 obj_06)
)
(:goal
(and
(pred_6 obj_05 obj_07)
(pred_6 obj_02 obj_01)
(pred_6 obj_03 obj_07)
)
)

(:constraints
  (sometime-before  (pred_6 obj_03 obj_07) (pred_1 obj_01))
)
)

; plan
1. (op_2 obj_06 obj_08)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_08)
   goals met: 2 of 3
2. (op_1 obj_03 obj_08)
   deleted: (pred_6 obj_03 obj_08) (pred_3)
   added: (pred_4 obj_03)
   goals met: 2 of 3
3. (op_2 obj_08 obj_01)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_01)
   goals met: 2 of 3
4. (op_3 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_6 obj_03 obj_01) (pred_3)
   goals met: 2 of 3
5. (op_1 obj_02 obj_01)
   deleted: (pred_6 obj_02 obj_01) (pred_3)
   added: (pred_4 obj_02)
   goals met: 1 of 3
6. (op_2 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 1 of 3
7. (op_3 obj_02 obj_07)
   deleted: (pred_4 obj_02)
   added: (pred_6 obj_02 obj_07) (pred_3)
   goals met: 1 of 3
8. (op_2 obj_07 obj_01)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_01)
   goals met: 1 of 3
9. (op_1 obj_03 obj_01)
   deleted: (pred_6 obj_03 obj_01) (pred_3)
   added: (pred_4 obj_03)
   goals met: 1 of 3
10. (op_2 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 1 of 3
11. (op_3 obj_03 obj_07)
   deleted: (pred_4 obj_03)
   added: (pred_6 obj_03 obj_07) (pred_3)
   goals met: 2 of 3
12. (op_1 obj_02 obj_07)
   deleted: (pred_6 obj_02 obj_07) (pred_3)
   added: (pred_4 obj_02)
   goals met: 2 of 3
13. (op_2 obj_07 obj_01)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_01)
   goals met: 2 of 3
14. (op_3 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_6 obj_02 obj_01) (pred_3)
   goals met: 3 of 3
